src/soap/openModeller.createModel.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:om="http://openmodeller.cria.org.br/xml/1.0"
 xmlns:omws="http://openmodeller.cria.org.br/ws/1.0">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
  <omws:createModel>
   <points>
    <coordsystem></coordsystem>
    <presences>
     <point latitude="0.0" longitude="0.0">
     </point>
    </presences>
    <absences>
     <point latitude="0.0" longitude="0.0">
     </point>
    </absences>
   </points>
   <maps>
    <map location="" categorical="0">
    </map>
   </maps>
   <mask location="">
   </mask>
   <algorithm Id="">
    <parameter Id="" Value="">
    </parameter>
   </algorithm>
   <output>
    <header></header>
    <scale>0</scale>
    <format></format>
   </output>
  </omws:createModel>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
